<?php
//2016年05月10日12:20:20 
//完成前5步

//1.需求文档
//2.画ER图
//3.workbench建立表的sql
//4.navicat导入以及其他操作
//5.安装框架并且使用框架
//
//
//6.开始写代码构建项目
//7.测试
//8.上线
//9.不断的修复和升级


//2016年05月11日12:20:39 
//完成后台登陆，修改密码，退出登陆


//2016年05月12日12:09:32
//完成分类的增删改查


//2016年05月13日09:35:32
//1.标签的增删改查
//2.文章添加

//扩展：文章编辑和删除到回收站，文章的真正删除



//2016年05月14日10:25:47
//1.删除文章到回收站，在回收站有“还原”和“删除”功能
//2.文章的编辑功能
//3.友情链接的增删改查

//文章和友情链接的所有功能都必须完成



//2016年05月16日10:48:04
//1.公共头部，导航条
//2.公共右侧，调出标签云，分类列表
//3.公共底部，调出最新文章、标签云、友情链接
//4.阅读全文


//总而言之：就是网站的全部功能（除了评论），每一个a链接都必须能点


//找页面：首页，列表页，内容页



//2016年05月17日10:15:48
//1.继续完善网站的所有功能
//2.伪静态，路由，气泡提示，多说评论
//3.找博客模板首页，列表页，内容页，调数据完成