<?php
2016年05月18日开始-----2016年6月10号

2016年05月20日08:44:47
页面整体布局


2016年05月24日09:11:58**************

要建立的表（类型表，类型属性表，分类表）

1.用workbench建模
2.
(1)后台登陆
(2)类型添加，编辑，删除
(3)类型属性的添加，编辑，删除

扩展：分类的增删改


2016年05月25日08:37:54***************
要建立的表（品牌表）
1.分类和品牌的所有功能

扩展：商品添加



2016年05月26日08:58:02
要建立的表（商品表，商品详情表，商品属性表）


1.商品添加，除了（商品属性和商品规格）
扩展：商品属性和商品规格的添加


// 一个商品有两套图 商品gid为1
// 1.jpg              2.jpg

// 缩略完成之后
// 1_small.jpg        2_small.jpg
// 1_mid.jpg          2_mid.jpg
// 1_big.jpg          2_big.jpg



// goods_details 商品详情表
// gd_id       img           details         gid
//  1          1.jpg,2.jpg   一大堆文字        1


2016年05月27日10:50:49
1.商品添加全部功能搞定
2.商品删除
3.商品编辑

扩展：前台左侧分类和点击分类根据分类查到商品



2016年06月01日11:29:33
1.首页左侧分类和顶级分类导航
2.点击分类进入到列表页然后把商品调出来


// 2016年06月06日09:45:00
1.订单完成

// 2016年06月08日16:34:24
1.订单完成



购物车-->订单-->个人中心-->后台订单管理-->填数据-->首页调数据-->筛选




// 2016年06月12日11:33:27
//1.事务、视图、缓存，至少打一遍









